<?php

return [

    // السماح بالوصول إلى أي API أو CSRF cookie
    'paths' => ['api/*', 'sanctum/csrf-cookie'],

    // السماح بكل الطرق
    'allowed_methods' => ['*'],

    // تحديد النطاقات المسموح لها بالوصول (تغييرها للنطاق الخاص بموقعك)
    'allowed_origins' => ['*'],

    // النطاقات المسموح بها (إذا كنت تستخدم النطاقات الفرعية أو نماذج معينة)
    'allowed_origins_patterns' => [],

    // السماح بكل الرؤوس
    'allowed_headers' => ['*'],

    // الرؤوس التي يمكن كشفها (عادةً ما تحتاجها إذا كنت تتعامل مع كائنات معقدة)
    'exposed_headers' => [],

    // مدة صلاحية الكاش
    'max_age' => 0,

    // دعم إرسال التوكنات أو الكوكيز عبر CORS
    'supports_credentials' => true, // حدد true إذا كنت بحاجة إلى دعم الكوكيز (التوكنات)
];
