<?php

    return [
        'title' => 'المستحدمين',
        'description' => 'عرض المستحدمين',
        'add' => 'اضافة مستحدم',
        'edit' => 'تعديل مستحدم',
        'delete' => 'حذف مستحدم',
        'name' => 'الاسم',
        'email' => 'البريد الالكتروني',
        'phone' => 'رقم الهاتف',
        'address' => 'العنوان',
        'city' => 'المدينة',
        'state' => 'المحافظة',
        'country' => 'الدولة',
        'status' => 'الحالة',
        'active' => 'نشط',
        'inactive' => 'غير نشط',
        'actions' => 'العمليات',
        'create' => 'اضافة مستحدم جديد',
        'update' => 'تعديل مستحدم',

    ];